
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СкидкиТаблица = Скидки.Выгрузить();
	Проверка = СкидкиТаблица[0].НоменклатураНоменклатурнаяГруппа.Наименование;
	Счётчик = Неопределено;
	
	
	Для Счётчик = 1 По (СкидкиТаблица.Количество() - 1) Цикл
		Если Проверка = СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование Тогда
			
			Сообщить("Найден повтор в списке. Повторяющийся элемент - " + СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование);
			Отказ = Истина;
			
		Иначе 
			Проверка = СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование;
		КонецЕсли;
		
	КонецЦикла;

	Движения.Скидки.Записывать = Истина;
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрокаСкидки.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрокаСкидки.Скидка;
		Движение.Ответственный = Ответственный;
	КонецЦикла;
КонецПроцедуры





