
Процедура ПередЗаписью(Отказ)
	
	ЮрЛицо = Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответ = ПроверкаИННСервер.КорректныйИНН(ИНН, ЮрЛицо);
	Если Ответ[0] = Ложь Тогда
		//ПоказатьПредупреждение(,Ответ[1], 3, "Ошибка заполнения ИНН");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Ответ[1];
		//Сообщение.Поле = "ИНН";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры





