
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Элементы.Тип.ВыделенныйТекст = "Физическое лицо" Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли; 
	
	ЗапретРасшифровкиНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И Объект.ПолноеНаименование = РасшифровкаТекста(Объект.Наименование);
	
	
		
		
		
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗапретРасшифровкиНаименования Тогда
	
		Если Элементы.Тип.ВыделенныйТекст = "Юридическое лицо" Тогда
		
			

			Объект.ПолноеНаименование = РасшифровкаТекста(Объект.Наименование);
		
		КонецЕсли;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаТекста(ТекстРасшифровки)
	
	РазбитаяСтрока = СтрРазделить(ТекстРасшифровки, " .,!?", Ложь);
	
	Если РазбитаяСтрока.Найти("АО") = 0 ИЛИ РазбитаяСтрока.Найти("ао") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Акционерное общество");
		
	ИначеЕсли РазбитаяСтрока.Найти("ООО") = 0 ИЛИ РазбитаяСтрока.Найти("ооо") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Общество с ограниченной ответственностью");
	ИначеЕсли РазбитаяСтрока.Найти("ИП") = 0 ИЛИ РазбитаяСтрока.Найти("ип") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Индивидуальный предприниматель");
		
	КонецЕсли;
	Возврат СтрСоединить(РазбитаяСтрока, " ");

КонецФункции

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Ответ = ПроверкаИНН();
	Если Ответ[0] = Ложь Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Ответ[1];
		Сообщение.Поле = "Объект.ИНН";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

 


&НаСервере
Функция ПроверкаИНН()
	
	ЮрЛицо = Объект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ИНН = Объект.ИНН;
	Возврат ПроверкаИННСервер.КорректныйИНН(ИНН, ЮрЛицо);
	
КонецФункции





