

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры 


&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииКоличества(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииЦены(ТекущиеДанныеТаблицы);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСуммы(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСтавкиНДС(ТекущиеДанныеТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиПриИзменении(Элемент)
	Объект.Сумма = Объект.ТоварыИУслуги.Итог("Сумма") + Объект.ТоварыИУслуги.Итог("СуммаНДС"); 
КонецПроцедуры


