
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Диаграмма.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗарплатаФактическийПериодДействия.Сотрудник КАК Сотрудник,
	               |	ЗарплатаФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	               |	ЗарплатаФактическийПериодДействия.ПериодДействияНачало КАК Начало,
	               |	ЗарплатаФактическийПериодДействия.ПериодДействияКонец КАК Конец
	               |ИЗ
	               |	РегистрРасчета.Зарплата.ФактическийПериодДействия КАК ЗарплатаФактическийПериодДействия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник); 
		Серия = Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = Выборка.Начало;
		Интервал.Конец = Выборка.Конец;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
