Функция КорректныйИНН(ИНН, Юрлицо = Истина) Экспорт
	Если ИНН = "" Тогда;
		Возврат РезультатПроверки(Истина);
	КонецЕсли;
		
	Если Юрлицо Тогда
		Если СтрДлина(ИНН) = 10 Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "Для юридического лица ИНН должен содержать 10 символов.");
		КонецЕсли;
		Если ЦифрыИНН(ИНН) Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "ИНН должен содержать только цифры.");
		КонецЕсли;
		Если ВеренЮр(ИНН) Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "Не корректный контрольный разряд.");
		КонецЕсли;
		Возврат РезультатПроверки(Истина);
	Иначе
		Если СтрДлина(ИНН) = 12 Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "Для физического лица ИНН должен содержать 12 символов.");
		КонецЕсли;
		Если ЦифрыИНН(ИНН) Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "ИНН должен содержать только цифры.");
		КонецЕсли;
		Если ВеренФиз(ИНН) Тогда
			Результат = Истина;
		Иначе
			Возврат РезультатПроверки(Ложь, "Не корректный контрольный разряд.");
		КонецЕсли;
		Возврат РезультатПроверки(Результат);
		
		
	КонецЕсли;
	
КонецФункции

Функция ЦифрыИНН(ИНН)
	
	СтрокаСЦифрами = "0 1 2 3 4 5 6 7 8 9";
	ДлинаИНН = СтрДлина(ИНН);
	Для Счётчик = 0 По ДлинаИНН Цикл
		Если СтрНайти(СтрокаСЦифрами, Сред(ИНН, Счётчик, 1)) Тогда
			Продолжить;
		Иначе 
			Возврат Ложь;
			
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	

КонецФункции 

Функция ВеренЮр(ИНН)
	
	СтрокаКоэф = "2, 4, 10, 3, 5, 9, 4, 6, 8";
	ПоследовательностьМассив = СтрРазделить(СтрокаКоэф, " ,", Ложь);
	Счётчик = 1;
	МояСумма = 0;
	Для Каждого МоёЧисло Из ПоследовательностьМассив Цикл
		МояСумма = МояСумма + Число(МоёЧисло) * Сред(ИНН, Счётчик, 1);
		Счётчик = Счётчик + 1;
	КонецЦикла;
	
	МояСумма1 = Цел(МояСумма / 11) * 11;
	КонтрольныйРазряд = МояСумма - МояСумма1;
	Если КонтрольныйРазряд = 10 Тогда 
		КонтрольныйРазряд = 0;
	КонецЕсли;
	Если КонтрольныйРазряд = Число(Сред(ИНН, 10, 1)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ВеренФиз(ИНН)
	
	СтрокаКоэф = "3, 7, 2, 4, 10, 3, 5, 9, 4, 6, 8";
	ПоследовательностьМассив = СтрРазделить(СтрокаКоэф, " ,", Ложь);
	Счётчик = 1;
	МояСумма = 0;
	Для Каждого МоёЧисло Из ПоследовательностьМассив Цикл
		МояСумма = МояСумма + Число(МоёЧисло) * Сред(ИНН, Счётчик, 1);
		Счётчик = Счётчик + 1;
	КонецЦикла;
	
	МояСумма1 = Цел(МояСумма / 11) * 11;
	КонтрольныйРазряд = МояСумма - МояСумма1;
	Если КонтрольныйРазряд = 10 Тогда 
		КонтрольныйРазряд = 0;
	КонецЕсли;
	Если КонтрольныйРазряд = Число(Сред(ИНН, 12, 1)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции   

Функция РезультатПроверки(Результат, Ошибка = "")
	
	Ответ = Новый Массив;
	Если Результат Тогда
		Ответ.Добавить(Результат);
		Возврат Ответ;
	Иначе
		Ответ.Добавить(Результат);
		Ответ.Добавить(Ошибка);
		Возврат Ответ;
	КонецЕсли;
		
	
КонецФункции


