

&НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, ЭтотОбъект.Объект.Дата);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Скидки.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	
	
	ПриИзмененииНоменклатурыНоменклатурнойГруппы(ТекущиеДанныеТаблицы);
	
КонецПроцедуры
