
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	НаборСимволов = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
    ДлинаПароля = 6;
    СлПароль = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел(); 
	
    
    // Генерируем пароль
    Для Счетчик = 1 По ДлинаПароля Цикл
        СлСимвол = Сред(НаборСимволов, ГСЧ.СлучайноеЧисло(0, СтрДлина(НаборСимволов)), 1);
        СлПароль = СлПароль + СлСимвол;
	КонецЦикла;
	
	Элементы.Пароль.РежимПароля = Ложь;
    
	Пароль = СлПароль;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Пользователя = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если Пользователя <> Неопределено Тогда 
		
		ВходРазрешён = Пользователя.АутентификацияСтандартная;
		ИмяДляВхода = Пользователя.Имя;
		Пароль = Пользователя.СохраняемоеЗначениеПароля
	Иначе
		
		ВходРазрешён = Ложь;
		

			
	КонецЕсли;
		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователя = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	
	Если Пользователя <> Неопределено Тогда 
		
		Пользователя.АутентификацияСтандартная = ВходРазрешён;
		Пользователя.ПолноеИмя = Объект.Наименование;
		Пользователя.Имя = ИмяДляВхода;
		Пользователя.Пароль = Пароль;
		Пользователя.Записать();
		
	ИначеЕсли ВходРазрешён Тогда
		
		
		Пользователя = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователя.АутентификацияСтандартная = ВходРазрешён;
		Пользователя.ПолноеИмя = Объект.Наименование;
		Пользователя.Имя = ИмяДляВхода;
		Пользователя.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		Пользователя.Пароль = Пароль;
		Пользователя.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = Пользователя.УникальныйИдентификатор;
		
		
		
		
	КонецЕсли;

	
	
	
КонецПроцедуры


