
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЦеныТаблица = Цены.Выгрузить();
	Проверка = ЦеныТаблица[0].Номенклатура.Наименование;
	Счётчик = Неопределено;
	
	
	Для Счётчик = 1 По (ЦеныТаблица.Количество() - 1) Цикл
		Если Проверка = ЦеныТаблица[Счётчик].Номенклатура.Наименование Тогда
			
			Сообщить("Найден повтор в списке. Повторяющийся элемент - " + ЦеныТаблица[Счётчик].Номенклатура.Наименование);
			Отказ = Истина;
			
		Иначе 
			Проверка = ЦеныТаблица[Счётчик].Номенклатура.Наименование;
		КонецЕсли;
		
	КонецЦикла;

	Движения.Цены.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.Ответственный = Ответственный;
	КонецЦикла;
КонецПроцедуры





