Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровИУслугТоварыИУслуги.Количество КАК Количество,
	               |	ПоступлениеТоваровИУслугТоварыИУслуги.Сумма + ПоступлениеТоваровИУслугТоварыИУслуги.СуммаНДС КАК Сумма,
	               |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК Тип
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	

	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			ДвижениеТовары = Движения.Товары.Добавить();
			ДвижениеТовары.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеТовары.Период = Дата;
			ДвижениеТовары.Ответственный = Ответственный;
			ДвижениеТовары.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовары.Количество = Выборка.Количество;
			ДвижениеТовары.Сумма = Выборка.Сумма;
			
			// Регистр Бухгалтерии.
			
			ПроводкаДвиженияУправленческий = Движения.Управленческий.Добавить();
			ПроводкаДвиженияУправленческий.Период = Дата;
			ПроводкаДвиженияУправленческий.Активность = Истина;
			
			ПроводкаДвиженияУправленческий.СчетДт = ПланыСчетов.Управленческий.Товары;
			ПроводкаДвиженияУправленческий.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ПроводкаДвиженияУправленческий.СчетКт = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
			ПроводкаДвиженияУправленческий.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
			
			ПроводкаДвиженияУправленческий.Сумма = Выборка.Сумма;
			Движения.Управленческий.Записать();
			
			
			
		Иначе
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасходы.Ответственный = Ответственный;
			ДвижениеРасходы.Сумма = Выборка.Сумма;
			
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ДвижениеВзаиморасчёты = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеВзаиморасчёты.ВидДвижения = ВидДвиженияНакопления.Расход; 
	ДвижениеВзаиморасчёты.Период = Дата;
	ДвижениеВзаиморасчёты.Контрагент = Поставщик;
	ДвижениеВзаиморасчёты.Ответственный = Ответственный;
	ДвижениеВзаиморасчёты.Сумма = Сумма;
	
	
	
	
	
	
	

	
КонецПроцедуры
