
Процедура ОбработкаПроведения(Отказ, Режим)

	
	Движения.Зарплата.Очистить();
	
	//Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = Начисление;
		Движение.ПериодДействияНачало = НачалоМесяца(НачалоПериодаДействия);
		Движение.ПериодДействияКонец = КонецМесяца(КонецПериодаДействия);
		Движение.ПериодРегистрации = Дата;
		//Движение.БазовыйПериодНачало = НачалоПериодаДействия;
		//Движение.БазовыйПериодКонец = КонецПериодаДействия;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
	КонецЦикла;
	
	Движения.Зарплата.Записать();

КонецПроцедуры
