Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	//Добавить общий модуль ЦеныВызовСервера с флажками "Сервер", 
	//"Внешнее соединение" и "Вызов сервера", и создать в нем функцию ЦенаНаДату
	//для вызова из клиентского кода форм,
	//которая вызовет одноименную функцию из модуля ЦеныСервер.
	
	Возврат ЦеныСервер.ЦенаНаДату(Номенклатура, Дата);

КонецФункции

Функция СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата) Экспорт
	
	//Добавить общий модуль ЦеныВызовСервера с флажками "Сервер", 
	//"Внешнее соединение" и "Вызов сервера", и создать в нем функцию ЦенаНаДату
	//для вызова из клиентского кода форм,
	//которая вызовет одноименную функцию из модуля ЦеныСервер.
	
	Возврат ЦеныСервер.СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата);

КонецФункции