Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт 
	
	//для ставки 20% и суммы 120 р сумма НДС будет равна
	//	120 * 0.2 / (1 + 0.2) = 20
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Возврат Сумма * (0.2 / (1 + 0.2));
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда 
		Возврат Сумма * (0.1 / (1 + 0.1));
	Иначе 
		Возврат Сумма * 0;
	КонецЕсли;
	
	
	//Создать в нем функцию СуммаНДСПоСтавке(Сумма, СтавкаНДС), 
	//возвращающую сумму НДС, рассчитанную от суммы по ставке согласно 
	//требованиям. Чтобы обеспечить работоспособность на клиенте, 
	//для получения значений ставок НДС используйте функцию ПредопределенноеЗначение().

КонецФункции